In [1]:
import numpy as np

In [2]:
import pandas as pd

In [3]:
df = pd.read_excel('C:\\PythonLibraries\\Project\\Sales Data.xlsx')

In [4]:
df.shape

(1081, 15)

In [5]:
df.head()

,User_ID,Cust_name,Product_ID,Gender,Age Group,Age,Marital_Status,State,Zone,Occupation,Product_Category,Orders,Amount,Status,unnamed1
0,1002903,Sanskriti,P00125942,F,26-35,28,0,Maharashtra,Western,Healthcare,Auto,1,23952.0,NaN,NaN
1,1000732,Kartik,P00110942,F,26-35,35,1,Andhra Pradesh,Southern,Govt,Auto,3,23934.0,NaN,NaN
2,1001990,Bindu,P00118542,F,26-35,35,1,Uttar Pradesh,Central,Automobile,Auto,3,23924.0,NaN,NaN
3,1001425,Sudevi,P00237842,M,0-17,16,0,Karnataka,Southern,Construction,Auto,2,23912.0,NaN,NaN
4,1000588,Joni,P00057942,M,26-35,28,1,Gujarat,Western,Food Processing,Auto,2,23877.0,NaN,NaN

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1081 entries, 0 to 1080
Data columns (total 15 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   User_ID           1081 non-null   int64
 1   Cust_name         1081 non-null   object
 2   Product_ID        1081 non-null   object
 3   Gender            1081 non-null   object
 4   Age Group         1081 non-null   object
 5   Age               1081 non-null   int64
 6   Marital_Status    1081 non-null   int64
 7   State             1081 non-null   object
 8   Zone              1081 non-null   object
 9   Occupation        1081 non-null   object
 10  Product_Category  1081 non-null   object
 11  Orders            1081 non-null   int64
 12  Amount            1069 non-null   float64
 13  Status            0 non-null      float64
 14  unnamed1          0 non-null      float64
dtypes: float64(3), int64(4), object(8)
memory usage: 126.8+ KB

In [7]:
df.drop(['Status','unnamed1'], axis=1 , inplace=True)

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1081 entries, 0 to 1080
Data columns (total 13 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   User_ID           1081 non-null   int64
 1   Cust_name         1081 non-null   object
 2   Product_ID        1081 non-null   object
 3   Gender            1081 non-null   object
 4   Age Group         1081 non-null   object
 5   Age               1081 non-null   int64
 6   Marital_Status    1081 non-null   int64
 7   State             1081 non-null   object
 8   Zone              1081 non-null   object
 9   Occupation        1081 non-null   object
 10  Product_Category  1081 non-null   object
 11  Orders            1081 non-null   int64
 12  Amount            1069 non-null   float64
dtypes: float64(1), int64(4), object(8)
memory usage: 109.9+ KB

In [9]:
pd.isnull(df)

,User_ID,Cust_name,Product_ID,Gender,Age Group,Age,Marital_Status,State,Zone,Occupation,Product_Category,Orders,Amount
0,False,False,False,False,False,False,False,False,False,False,False,False,False
1,False,False,False,False,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False,False,False,False,False
3,False,False,False,False,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False,False,False,False,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...
1076,False,False,False,False,False,False,False,False,False,False,False,False,False
1077,False,False,False,False,False,False,False,False,False,False,False,False,False
1078,False,False,False,False,False,False,False,False,False,False,False,False,False
1079,False,False,False,False,False,False,False,False,False,False,False,False,False
1080,False,False,False,False,False,False,False,False,False,False,False,False,False

In [10]:
pd.isnull(df).sum()

User_ID              0
Cust_name            0
Product_ID           0
Gender               0
Age Group            0
Age                  0
Marital_Status       0
State                0
Zone                 0
Occupation           0
Product_Category     0
Orders               0
Amount              12
dtype: int64

In [11]:
df.dropna(inplace=True)

In [12]:
pd.isnull(df).sum()

User_ID             0
Cust_name           0
Product_ID          0
Gender              0
Age Group           0
Age                 0
Marital_Status      0
State               0
Zone                0
Occupation          0
Product_Category    0
Orders              0
Amount              0
dtype: int64

In [13]:
df['Amount'] = df['Amount'].astype('int')

In [14]:
df['Amount'].dtype

dtype('int64')

In [15]:
df['Marital_Status'] = df['Marital_Status'].map({1: 'Yes', 0: 'No'})

In [16]:
df.columns

Index(['User_ID', 'Cust_name', 'Product_ID', 'Gender', 'Age Group', 'Age',
       'Marital_Status', 'State', 'Zone', 'Occupation', 'Product_Category',
       'Orders', 'Amount'],
      dtype='object')

In [17]:
category_revenue = df.groupby('Product_Category')['Amount'].sum().sort_values(ascending=False)

In [18]:
print(category_revenue)

Product_Category
Food                  10013578
Footwear & Shoes       5379412
Furniture              2066800
Auto                   1773753
Stationery             1051991
Tupperware              611806
Hand & Power Tools      218176
Name: Amount, dtype: int64

In [19]:
zone_summary = df.groupby('Zone')[['Orders', 'Amount']].sum().sort_values(by='Amount', ascending=False)

In [20]:
print(zone_summary)

          Orders   Amount
Zone
Central     1122  9054063
Southern     799  6286628
Western      396  3191172
Northern     220  1698211
Eastern      108   885442

In [21]:
gender_summary = df.groupby('Gender')[['Orders', 'Amount']].sum()

In [22]:
print(gender_summary)

        Orders    Amount
Gender
F         1844  14552421
M          801   6563095

In [23]:
age_summary = df.groupby('Age Group')[['Orders', 'Amount']].sum().sort_values(by='Amount', ascending=False)

In [24]:
print(age_summary)

           Orders   Amount
Age Group
26-35        1091  8444952
36-45         555  4483779
18-25         418  3344714
51-55         232  1864258
46-50         188  1727136
55+           107   795699
0-17           54   454978

In [25]:
top_customers = df.groupby(['Cust_name'])['Amount'].sum().sort_values(ascending=False).head(10)

In [26]:
print(top_customers)

Cust_name
Neola       184746
Bhawna      117464
Sandra      116806
Vasudev     100650
Mahima      100447
James        98567
Ginny        96619
Martinez     95387
Gelder       92952
Kushal       84260
Name: Amount, dtype: int64

In [27]:
occupation_spending = df.groupby('Occupation')['Amount'].sum().sort_values(ascending=False)

In [28]:
print(occupation_spending)

Occupation
IT Sector          2929246
Aviation           2740848
Healthcare         2635745
Banking            2078794
Govt               1893160
Media              1290120
Automobile         1190908
Chemical           1177567
Retail              950133
Food Processing     879172
Hospitality         851021
Lawyer              787348
Construction        721301
Textile             573124
Agriculture         417029
Name: Amount, dtype: int64

In [29]:
marital_summary = df.groupby('Marital_Status')[['Orders', 'Amount']].sum()

In [30]:
print(marital_summary)

                Orders    Amount
Marital_Status
No                1573  12504398
Yes               1072   8611118

In [31]:
df.to_csv('retail_data_cleaned.csv', index=False)

In [ ]:
print (1+2)